{
  "task": "Арнольд вивчає поширеність трьох факторів ризику для здоров'я, позначених A, B та C, серед чоловіків. Для кожного з трьох факторів ймовірність того, що випадково обраний чоловік має лише цей фактор ризику (і жоден з інших) становить 0.1. Для будь-яких двох з трьох факторів ймовірність того, що випадково обраний чоловік має саме ці два фактори ризику (але не третій) становить 0.14. Ймовірність того, що випадково обраний чоловік має всі три фактори ризику, за умови, що він має A і B, дорівнює $\\frac{1}{3}$. Ймовірність того, що чоловік не має жодного з трьох факторів ризику, за умови, що він не має фактора ризику A, дорівнює $\\frac{p}{q}$, де $p$ і $q$ - це взаємно прості додатні цілі числа. Знайдіть $p+q$.",
  "solution": "Спочатку припустимо, що населення складає $100$ для полегшення розв'язання. Потім ми просто організуємо надану статистику в діаграму Венна.\n[asy]  pair A,B,C,D,E,F,G; A=(0,55); B=(60,55); C=(60,0); D=(0,0); draw(A--B--C--D--A); E=(30,35); F=(20,20); G=(40,20); draw(circle(E,15)); draw(circle(F,15)); draw(circle(G,15));  draw(\"A\",(30,52)); draw(\"B\",(7,7)); draw(\"C\",(53,7));  draw(\"100\",(5,60)); draw(\"10\",(30,40)); draw(\"10\",(15,15)); draw(\"10\",(45,15));  draw(\"14\",(30,16)); draw(\"14\",(38,29)); draw(\"14\",(22,29));  draw(\"$x$\",(30,25)); draw(\"$y$\",(10,45));  [/asy]\nНехай $x$ - це кількість чоловіків з усіма трьома факторами ризику. Оскільки \"ймовірність того, що випадково обраний чоловік має всі три фактори ризику, за умови, що він має A і B, дорівнює $\\frac{1}{3}$\", ми можемо сказати, що $x = \\frac{1}{3}(x+14)$, оскільки є $x$ людей з усіма трьома факторами і 14 з лише A і B. Таким чином, $x=7$.\nНехай $y$ - це кількість чоловіків без факторів ризику. Тепер слідує, що\\[y= 100 - 3 \\cdot 10 - 3 \\cdot 14 - 7 = 21.\\]Кількість чоловіків з фактором ризику A дорівнює $10+2 \\cdot 14+7 = 45$ (10 з лише A, 28 з A і одним з інших, і 7 з усіма трьома). Таким чином, кількість чоловіків без фактора ризику $A$ дорівнює 55, тому бажана умовна ймовірність дорівнює $21/55$. Отже, відповідь: $21+55=\\boxed{76}$.",
  "answer": "76",
  "has_numerical_answer": true
}